Revit 2027 API
PathOfTravel.UpdateMultiple(Document, IList<ElementId>) Method
 Updates the specified paths of travel by recalculating each path using their original start and end points.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static int UpdateMultiple(
	Document adoc,
	IList<ElementId> elementsToUpdate
)
Public Shared Function UpdateMultiple (
	adoc As Document,
	elementsToUpdate As IList(Of ElementId)
) As Integer
public:
static int UpdateMultiple(
	Document^ adoc,
	IList<ElementId^>^ elementsToUpdate
)
static member UpdateMultiple :
        adoc : Document *
        elementsToUpdate : IList<ElementId> -> int
Parameters
adoc Document
 Document of elements to be updated.
elementsToUpdate IList<ElementId>
 The list of ElementIdof the paths to update.
Return Value
Int32
 number of successfully updated elements
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This functionality is not available in Revit LT.
Remarks
 For unsuccessfully updated elements, Revit will post warnings.
See Also
Reference
PathOfTravel Class
UpdateMultiple Overload
Autodesk.Revit.DB.Analysis Namespace